[
  "obsidian-style-settings",
  "obsidian-linter",
  "obsidian-git",
  "better-word-count",
  "obsidian-html-tags-autocomplete",
  "colored-tags",
  "obsidian-frontmatter-tag-suggest",
  "floating-toc",
  "obsidian-scroll-to-top-plugin",
  "obsidian-better-command-palette",
  "darlal-switcher-plus",
  "creases",
  "obsidian-relative-line-numbers",
  "editing-toolbar",
  "obsidian-file-link",
  "obsidian-cursor-location-plugin",
  "obsidian-auto-link-title",
  "obsidian-icon-folder",
  "obsidian-table-generator",
  "table-editor-obsidian",
  "table-extended",
  "markdown-table-editor",
  "cm-chs-patch",
  "keyboard-analyzer",
  "obsidian-show-file-path",
  "obsidian-better-codeblock",
  "obsidian-minimal-settings",
  "calendar",
  "obsidian-quiet-outline"
]