#          ╭──────────────────────────────────────────────────────────╮
#          │                       基础脚本                       │
#          ╰──────────────────────────────────────────────────────────╯

# -------------------------引入脚本区------------------------- #
# source ./ob_base_func.sh

# -------------------------函数定义区------------------------ #

# 打开Vault
# 参数：vault 名称
function open_vault() {

	local vault_name=$1

	# 检测参数
	if [[ $# -lt 1 || -z $vault_name ]]; then
		echo -e "\e[96mvault名称不能为空！打开vault失败！\n \e[0m"
		return 1
	fi

	# 打开vault
	xdg-open "obsidian://open?vault=$vault_name"

}

# ---------------------------------测试区--------------------------------- #
open_vault $@
